zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
/*!< APB2 Non secure peripherals */
#define TIM1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00002C00UL)
#define SPI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00003000UL)
#define TIM8_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00003400UL)
#define USART1_BASE_NS                  (APB2PERIPH_BASE_NS + 0x00003800UL)
#define TIM12_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00003C00UL)
#define TIM15_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004000UL)
#define TIM16_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004400UL)
#define TIM17_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004800UL)
#define SAI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00005400UL)
#define SAI1_Block_A_BASE_NS            (SAI1_BASE_NS + 0x0000004UL)
#define SAI1_Block_B_BASE_NS            (SAI1_BASE_NS + 0x0000024UL)
#define USB_DRD_BASE_NS                 (APB2PERIPH_BASE_NS + 0x00006000UL)
#define USB_DRD_PMAADDR_NS              (APB2PERIPH_BASE_NS + 0x00006400UL)
#define I3C2_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00006C00UL)

/*!< AHB1 Non secure peripherals */
#define GPDMA1_BASE_NS                  (AHB1PERIPH_BASE_NS)
#define GPDMA1_Channel0_BASE_NS         (GPDMA1_BASE_NS + 0x00000050UL)
#define GPDMA1_Channel1_BASE_NS         (GPDMA1_BASE_NS + 0x000000D0UL)
#define GPDMA1_Channel2_BASE_NS         (GPDMA1_BASE_NS + 0x00000150UL)
#define GPDMA1_Channel3_BASE_NS         (GPDMA1_BASE_NS + 0x000001D0UL)
#define GPDMA1_Channel4_BASE_NS         (GPDMA1_BASE_NS + 0x00000250UL)
#define GPDMA1_Channel5_BASE_NS         (GPDMA1_BASE_NS + 0x000002D0UL)
#define GPDMA1_Channel6_BASE_NS         (GPDMA1_BASE_NS + 0x00000350UL)
#define GPDMA1_Channel7_BASE_NS         (GPDMA1_BASE_NS + 0x000003D0UL)
#define GPDMA1_Channel8_BASE_NS         (GPDMA1_BASE_NS + 0x00000450UL)
#define GPDMA1_Channel9_BASE_NS         (GPDMA1_BASE_NS + 0x000004D0UL)
#define GPDMA1_Channel10_BASE_NS        (GPDMA1_BASE_NS + 0x00000550UL)
#define GPDMA1_Channel11_BASE_NS        (GPDMA1_BASE_NS + 0x000005D0UL)
#define FLASH_R_BASE_NS                 (AHB1PERIPH_BASE_NS + 0x00002000UL)
#define CRC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00003000UL)
#define TSC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00004000UL)
#define RAMCFG_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x00006000UL)
#define RAMCFG_SRAM1_BASE_NS            (RAMCFG_BASE_NS)
#define RAMCFG_SRAM2_BASE_NS            (RAMCFG_BASE_NS + 0x00000040UL)
#define RAMCFG_SRAM3_BASE_NS            (RAMCFG_BASE_NS + 0x00000080UL)
#define HSP1_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x0000C000UL)
#define ICACHE_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x00010400UL)
#define PWR_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00010800UL)
#define RCC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00010C00UL)
#define EXTI_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x00012000UL)
#define GTZC_TZSC1_BASE_NS              (AHB1PERIPH_BASE_NS + 0x00012400UL)
#define GTZC_MPCBB1_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00012C00UL)
#define GTZC_MPCBB2_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00013000UL)
#define GTZC_MPCBB3_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00013400UL)
#define GTZC_MPCBB4_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00013800UL)
#define ADF1_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x00014000UL)
#define ADF1_Filter0_BASE_NS            (ADF1_BASE_NS + 0x00000080UL)

/*!< APB3 Non secure peripherals */
#define SYSCFG_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00000400UL)
#define LPUART1_BASE_NS                 (APB3PERIPH_BASE_NS + 0x00002400UL)
#define I2C3_BASE_NS                    (APB3PERIPH_BASE_NS + 0x00002800UL)
#define LPTIM1_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004400UL)
#define LPTIM3_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004800UL)
#define LPTIM4_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004C00UL)
#define COMP1_BASE_NS                   (APB3PERIPH_BASE_NS + 0x00005400UL)
#define COMP2_BASE_NS                   (COMP1_BASE_NS + 0x00000004UL)
#define LCD_BASE_NS                     (APB3PERIPH_BASE_NS + 0x00008000UL)

/*!< AHB2 Non secure peripherals */
#define GPIOA_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000000UL)
#define GPIOB_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000400UL)
#define GPIOC_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000800UL)
#define GPIOD_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000C00UL)
#define GPIOE_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001000UL)
#define GPIOF_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001400UL)
#define GPIOG_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001800UL)
#define GPIOH_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001C00UL)
#define ADC1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008000UL)
#define ADC2_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008100UL)
#define ADC12_COMMON_BASE_NS            (AHB2PERIPH_BASE_NS + 0x00008300UL)
#define DAC1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008400UL)
#define HASH_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x000A0400UL)
#define HASH_DIGEST_BASE_NS             (AHB2PERIPH_BASE_NS + 0x000A0710UL)
#define RNG_BASE_NS                     (AHB2PERIPH_BASE_NS + 0x000A0800UL)
#define PKA_BASE_NS                     (AHB2PERIPH_BASE_NS + 0x000A2000UL)
#define PKA_RAM_BASE_NS                 (AHB2PERIPH_BASE_NS + 0x000A2400UL)
#define SDMMC1_BASE_NS                  (AHB2PERIPH_BASE_NS + 0x000A8000UL)
#define DLYB_SDMMC1_BASE_NS             (AHB2PERIPH_BASE_NS + 0x000A8400UL)
#define DLYB_OCTOSPI1_BASE_NS           (AHB2PERIPH_BASE_NS + 0x000AF000UL)
#define OCTOSPI1_R_BASE_NS              (AHB2PERIPH_BASE_NS + 0x000B1400UL)

#if defined(CPU_IN_SECURE_STATE)
/*!< Flash, Peripheral and internal SRAMs base addresses - secure */
#define FLASH_BASE_S                    0x0C000000UL  /*!< FLASH secure base address        */
#define SYSTEM_FLASH_BASE_S             0x0FF80000UL  /*!< System FLASH secure base address */
#define SRAM1_BASE_S                    0x30000000UL  /*!< SRAM1 secure base address        */
#define SRAM2_BASE_S                    0x30018000UL  /*!< SRAM2 secure base address        */
#define SRAM3_BASE_S                    0x30028000UL  /*!< SRAM3 secure base address        */
#define SRAM4_BASE_S                    0x30068000UL  /*!< SRAM4 secure base address        */
#define PERIPH_BASE_S                   0x50000000UL  /*!< Peripheral secure base address   */

