zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG_Pos                     (0UL)
#define FLASH_CR_PG_Msk                     (0x1UL << FLASH_CR_PG_Pos)              /*!< 0x00000001 */
#define FLASH_CR_PG                         FLASH_CR_PG_Msk                         /*!< Non-secure programming */
#define FLASH_CR_PER_Pos                    (1UL)
#define FLASH_CR_PER_Msk                    (0x1UL << FLASH_CR_PER_Pos)             /*!< 0x00000002 */
#define FLASH_CR_PER                        FLASH_CR_PER_Msk                        /*!< Non-secure page erase */
#define FLASH_CR_MER1_Pos                   (2UL)
#define FLASH_CR_MER1_Msk                   (0x1UL << FLASH_CR_MER1_Pos)            /*!< 0x00000004 */
#define FLASH_CR_MER1                       FLASH_CR_MER1_Msk                       /*!< Non-secure bank 1 mass erase */
#define FLASH_CR_PNB_Pos                    (3UL)
#define FLASH_CR_PNB_Msk                    (0xFFUL << FLASH_CR_PNB_Pos)            /*!< 0x000007F8 */
#define FLASH_CR_PNB                        FLASH_CR_PNB_Msk                        /*!< Non-secure page number selection */
#define FLASH_CR_BKER_Pos                   (11UL)
#define FLASH_CR_BKER_Msk                   (0x1UL << FLASH_CR_BKER_Pos)            /*!< 0x00000800 */
#define FLASH_CR_BKER                       FLASH_CR_BKER_Msk                       /*!< Non-secure bank selection for page erase */
#define FLASH_CR_BWR_Pos                    (14UL)
#define FLASH_CR_BWR_Msk                    (0x1UL << FLASH_CR_BWR_Pos)             /*!< 0x00004000 */
#define FLASH_CR_BWR                        FLASH_CR_BWR_Msk                        /*!< Non-secure burst write programming mode */
#define FLASH_CR_MER2_Pos                   (15UL)
#define FLASH_CR_MER2_Msk                   (0x1UL << FLASH_CR_MER2_Pos)            /*!< 0x00008000 */
#define FLASH_CR_MER2                       FLASH_CR_MER2_Msk                       /*!< Non-secure bank 2 mass erase */
#define FLASH_CR_STRT_Pos                   (16UL)
#define FLASH_CR_STRT_Msk                   (0x1UL << FLASH_CR_STRT_Pos)            /*!< 0x00010000 */
#define FLASH_CR_STRT                       FLASH_CR_STRT_Msk                       /*!< Non-secure start */
#define FLASH_CR_OPTSTRT_Pos                (17UL)
#define FLASH_CR_OPTSTRT_Msk                (0x1UL << FLASH_CR_OPTSTRT_Pos)         /*!< 0x00020000 */
#define FLASH_CR_OPTSTRT                    FLASH_CR_OPTSTRT_Msk                    /*!< Option modification Start */
#define FLASH_CR_EOPIE_Pos                  (24UL)
#define FLASH_CR_EOPIE_Msk                  (0x1UL << FLASH_CR_EOPIE_Pos)           /*!< 0x01000000 */
#define FLASH_CR_EOPIE                      FLASH_CR_EOPIE_Msk                      /*!< Non-secure end of operation interrupt enable */
#define FLASH_CR_ERRIE_Pos                  (25UL)
#define FLASH_CR_ERRIE_Msk                  (0x1UL << FLASH_CR_ERRIE_Pos)           /*!< 0x02000000 */
#define FLASH_CR_ERRIE                      FLASH_CR_ERRIE_Msk                      /*!< Non-secure error interrupt enable */
#define FLASH_CR_OBL_LAUNCH_Pos             (27UL)
#define FLASH_CR_OBL_LAUNCH_Msk             (0x1UL << FLASH_CR_OBL_LAUNCH_Pos)      /*!< 0x08000000 */
#define FLASH_CR_OBL_LAUNCH                 FLASH_CR_OBL_LAUNCH_Msk                 /*!< Force the option byte loading */
#define FLASH_CR_OPTLOCK_Pos                (30UL)
#define FLASH_CR_OPTLOCK_Msk                (0x1UL << FLASH_CR_OPTLOCK_Pos)         /*!< 0x40000000 */
#define FLASH_CR_OPTLOCK                    FLASH_CR_OPTLOCK_Msk                    /*!< Option Lock */
#define FLASH_CR_LOCK_Pos                   (31UL)
#define FLASH_CR_LOCK_Msk                   (0x1UL << FLASH_CR_LOCK_Pos)            /*!< 0x80000000 */
#define FLASH_CR_LOCK                       FLASH_CR_LOCK_Msk                       /*!< Non-secure Lock */

/*******************  Bits definition for FLASH_SCR register  *****************/
#define FLASH_SCR_PG_Pos                    (0UL)
#define FLASH_SCR_PG_Msk                    (0x1UL << FLASH_SCR_PG_Pos)             /*!< 0x00000001 */
#define FLASH_SCR_PG                        FLASH_SCR_PG_Msk                        /*!< Secure programming */
#define FLASH_SCR_PER_Pos                   (1UL)
#define FLASH_SCR_PER_Msk                   (0x1UL << FLASH_SCR_PER_Pos)            /*!< 0x00000002 */
#define FLASH_SCR_PER                       FLASH_SCR_PER_Msk                       /*!< Secure page erase */
#define FLASH_SCR_MER1_Pos                  (2UL)
#define FLASH_SCR_MER1_Msk                  (0x1UL << FLASH_SCR_MER1_Pos)           /*!< 0x00000004 */
#define FLASH_SCR_MER1                      FLASH_SCR_MER1_Msk                      /*!< Secure bank 1 mass erase */
#define FLASH_SCR_PNB_Pos                   (3UL)
#define FLASH_SCR_PNB_Msk                   (0xFFUL << FLASH_SCR_PNB_Pos)           /*!< 0x000007F8 */
#define FLASH_SCR_PNB                       FLASH_SCR_PNB_Msk                       /*!< Secure page number selection */
#define FLASH_SCR_BKER_Pos                  (11UL)
#define FLASH_SCR_BKER_Msk                  (0x1UL << FLASH_SCR_BKER_Pos)           /*!< 0x00000800 */
#define FLASH_SCR_BKER                      FLASH_SCR_BKER_Msk                      /*!< Secure bank selection for page erase */
#define FLASH_SCR_BWR_Pos                   (14UL)
#define FLASH_SCR_BWR_Msk                   (0x1UL << FLASH_SCR_BWR_Pos)            /*!< 0x00004000 */
#define FLASH_SCR_BWR                       FLASH_SCR_BWR_Msk                       /*!< Secure burst write programming mode */
#define FLASH_SCR_MER2_Pos                  (15UL)
#define FLASH_SCR_MER2_Msk                  (0x1UL << FLASH_SCR_MER2_Pos)           /*!< 0x00008000 */
#define FLASH_SCR_MER2                      FLASH_SCR_MER2_Msk                      /*!< Secure bank 2 mass erase */
#define FLASH_SCR_STRT_Pos                  (16UL)
#define FLASH_SCR_STRT_Msk                  (0x1UL << FLASH_SCR_STRT_Pos)           /*!< 0x00010000 */
#define FLASH_SCR_STRT                      FLASH_SCR_STRT_Msk                      /*!< Secure start */
#define FLASH_SCR_EOPIE_Pos                 (24UL)
#define FLASH_SCR_EOPIE_Msk                 (0x1UL << FLASH_SCR_EOPIE_Pos)          /*!< 0x01000000 */
#define FLASH_SCR_EOPIE                     FLASH_SCR_EOPIE_Msk                     /*!< Secure end of operation interrupt enable */
#define FLASH_SCR_ERRIE_Pos                 (25UL)
#define FLASH_SCR_ERRIE_Msk                 (0x1UL << FLASH_SCR_ERRIE_Pos)          /*!< 0x02000000 */
#define FLASH_SCR_ERRIE                     FLASH_SCR_ERRIE_Msk                     /*!< Secure error interrupt enable */
#define FLASH_SCR_INV_Pos                   (29UL)
#define FLASH_SCR_INV_Msk                   (0x1UL << FLASH_SCR_INV_Pos)            /*!< 0x20000000 */
#define FLASH_SCR_INV                       FLASH_SCR_INV_Msk                       /*!< Flash security state invert */
#define FLASH_SCR_LOCK_Pos                  (31UL)
#define FLASH_SCR_LOCK_Msk                  (0x1UL << FLASH_SCR_LOCK_Pos)           /*!< 0x80000000 */
#define FLASH_SCR_LOCK                      FLASH_SCR_LOCK_Msk                      /*!< Secure lock */

/*******************  Bits definition for FLASH_ECCCR register  **************/
#define FLASH_ECCCR_ADDR_ECC_Pos            (0UL)
#define FLASH_ECCCR_ADDR_ECC_Msk            (0xFFFFFUL << FLASH_ECCCR_ADDR_ECC_Pos) /*!< 0x000FFFFF */
#define FLASH_ECCCR_ADDR_ECC                FLASH_ECCCR_ADDR_ECC_Msk                /*!< ECC fail address */
#define FLASH_ECCCR_BK_ECC_Pos              (21UL)
#define FLASH_ECCCR_BK_ECC_Msk              (0x1UL << FLASH_ECCCR_BK_ECC_Pos)       /*!< 0x00200000 */
#define FLASH_ECCCR_BK_ECC                  FLASH_ECCCR_BK_ECC_Msk                  /*!< ECC fail bank */
#define FLASH_ECCCR_SYSF_ECC_Pos            (22UL)
#define FLASH_ECCCR_SYSF_ECC_Msk            (0x1UL << FLASH_ECCCR_SYSF_ECC_Pos)     /*!< 0x00400000 */
#define FLASH_ECCCR_SYSF_ECC                FLASH_ECCCR_SYSF_ECC_Msk                /*!< System Flash ECC fail */
#define FLASH_ECCCR_ECCIE_Pos               (24UL)
#define FLASH_ECCCR_ECCIE_Msk               (0x1UL << FLASH_ECCCR_ECCIE_Pos)        /*!< 0x01000000 */
#define FLASH_ECCCR_ECCIE                   FLASH_ECCCR_ECCIE_Msk                   /*!< ECC correction interrupt enable */
#define FLASH_ECCCR_ECCC_Pos                (30UL)
#define FLASH_ECCCR_ECCC_Msk                (0x1UL << FLASH_ECCCR_ECCC_Pos)         /*!< 0x40000000 */
#define FLASH_ECCCR_ECCC                    FLASH_ECCCR_ECCC_Msk                    /*!< ECC correction */

/*******************  Bits definition for FLASH_ECCDR register  **************/
#define FLASH_ECCDR_ADDR_ECC_Pos            (0UL)
#define FLASH_ECCDR_ADDR_ECC_Msk            (0xFFFFFUL << FLASH_ECCDR_ADDR_ECC_Pos) /*!< 0x000FFFFF */
#define FLASH_ECCDR_ADDR_ECC                FLASH_ECCDR_ADDR_ECC_Msk                /*!< ECC fail address */
#define FLASH_ECCDR_BK_ECC_Pos              (21UL)
#define FLASH_ECCDR_BK_ECC_Msk              (0x1UL << FLASH_ECCDR_BK_ECC_Pos)       /*!< 0x00200000 */
#define FLASH_ECCDR_BK_ECC                  FLASH_ECCDR_BK_ECC_Msk                  /*!< ECC fail bank */
#define FLASH_ECCDR_SYSF_ECC_Pos            (22UL)
#define FLASH_ECCDR_SYSF_ECC_Msk            (0x1UL << FLASH_ECCDR_SYSF_ECC_Pos)     /*!< 0x00400000 */
#define FLASH_ECCDR_SYSF_ECC                FLASH_ECCDR_SYSF_ECC_Msk                /*!< System Flash ECC fail */
#define FLASH_ECCDR_ECCD_Pos                (31UL)
#define FLASH_ECCDR_ECCD_Msk                (0x1UL << FLASH_ECCDR_ECCD_Pos)         /*!< 0x80000000 */
#define FLASH_ECCDR_ECCD                    FLASH_ECCDR_ECCD_Msk                    /*!< ECC detection */

