zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
/*******************  Bit definition for FLASH_SECBB2R1 register  ******************/
#define FLASH_SECBB2R1_SEC0_Pos                   (0UL)
#define FLASH_SECBB2R1_SEC0_Msk                   (0x1UL << FLASH_SECBB2R1_SEC0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R1_SEC0                       FLASH_SECBB2R1_SEC0_Msk                       /*!< Page 0 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC1_Pos                   (1UL)
#define FLASH_SECBB2R1_SEC1_Msk                   (0x1UL << FLASH_SECBB2R1_SEC1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R1_SEC1                       FLASH_SECBB2R1_SEC1_Msk                       /*!< Page 1 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC2_Pos                   (2UL)
#define FLASH_SECBB2R1_SEC2_Msk                   (0x1UL << FLASH_SECBB2R1_SEC2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R1_SEC2                       FLASH_SECBB2R1_SEC2_Msk                       /*!< Page 2 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC3_Pos                   (3UL)
#define FLASH_SECBB2R1_SEC3_Msk                   (0x1UL << FLASH_SECBB2R1_SEC3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R1_SEC3                       FLASH_SECBB2R1_SEC3_Msk                       /*!< Page 3 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC4_Pos                   (4UL)
#define FLASH_SECBB2R1_SEC4_Msk                   (0x1UL << FLASH_SECBB2R1_SEC4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R1_SEC4                       FLASH_SECBB2R1_SEC4_Msk                       /*!< Page 4 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC5_Pos                   (5UL)
#define FLASH_SECBB2R1_SEC5_Msk                   (0x1UL << FLASH_SECBB2R1_SEC5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R1_SEC5                       FLASH_SECBB2R1_SEC5_Msk                       /*!< Page 5 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC6_Pos                   (6UL)
#define FLASH_SECBB2R1_SEC6_Msk                   (0x1UL << FLASH_SECBB2R1_SEC6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R1_SEC6                       FLASH_SECBB2R1_SEC6_Msk                       /*!< Page 6 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC7_Pos                   (7UL)
#define FLASH_SECBB2R1_SEC7_Msk                   (0x1UL << FLASH_SECBB2R1_SEC7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R1_SEC7                       FLASH_SECBB2R1_SEC7_Msk                       /*!< Page 7 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC8_Pos                   (8UL)
#define FLASH_SECBB2R1_SEC8_Msk                   (0x1UL << FLASH_SECBB2R1_SEC8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R1_SEC8                       FLASH_SECBB2R1_SEC8_Msk                       /*!< Page 8 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC9_Pos                   (9UL)
#define FLASH_SECBB2R1_SEC9_Msk                   (0x1UL << FLASH_SECBB2R1_SEC9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R1_SEC9                       FLASH_SECBB2R1_SEC9_Msk                       /*!< Page 9 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC10_Pos                  (10UL)
#define FLASH_SECBB2R1_SEC10_Msk                  (0x1UL << FLASH_SECBB2R1_SEC10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R1_SEC10                      FLASH_SECBB2R1_SEC10_Msk                      /*!< Page 10 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC11_Pos                  (11UL)
#define FLASH_SECBB2R1_SEC11_Msk                  (0x1UL << FLASH_SECBB2R1_SEC11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R1_SEC11                      FLASH_SECBB2R1_SEC11_Msk                      /*!< Page 11 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC12_Pos                  (12UL)
#define FLASH_SECBB2R1_SEC12_Msk                  (0x1UL << FLASH_SECBB2R1_SEC12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R1_SEC12                      FLASH_SECBB2R1_SEC12_Msk                      /*!< Page 12 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC13_Pos                  (13UL)
#define FLASH_SECBB2R1_SEC13_Msk                  (0x1UL << FLASH_SECBB2R1_SEC13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R1_SEC13                      FLASH_SECBB2R1_SEC13_Msk                      /*!< Page 13 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC14_Pos                  (14UL)
#define FLASH_SECBB2R1_SEC14_Msk                  (0x1UL << FLASH_SECBB2R1_SEC14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R1_SEC14                      FLASH_SECBB2R1_SEC14_Msk                      /*!< Page 14 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC15_Pos                  (15UL)
#define FLASH_SECBB2R1_SEC15_Msk                  (0x1UL << FLASH_SECBB2R1_SEC15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R1_SEC15                      FLASH_SECBB2R1_SEC15_Msk                      /*!< Page 15 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC16_Pos                  (16UL)
#define FLASH_SECBB2R1_SEC16_Msk                  (0x1UL << FLASH_SECBB2R1_SEC16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R1_SEC16                      FLASH_SECBB2R1_SEC16_Msk                      /*!< Page 16 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC17_Pos                  (17UL)
#define FLASH_SECBB2R1_SEC17_Msk                  (0x1UL << FLASH_SECBB2R1_SEC17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R1_SEC17                      FLASH_SECBB2R1_SEC17_Msk                      /*!< Page 17 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC18_Pos                  (18UL)
#define FLASH_SECBB2R1_SEC18_Msk                  (0x1UL << FLASH_SECBB2R1_SEC18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R1_SEC18                      FLASH_SECBB2R1_SEC18_Msk                      /*!< Page 18 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC19_Pos                  (19UL)
#define FLASH_SECBB2R1_SEC19_Msk                  (0x1UL << FLASH_SECBB2R1_SEC19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R1_SEC19                      FLASH_SECBB2R1_SEC19_Msk                      /*!< Page 19 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC20_Pos                  (20UL)
#define FLASH_SECBB2R1_SEC20_Msk                  (0x1UL << FLASH_SECBB2R1_SEC20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R1_SEC20                      FLASH_SECBB2R1_SEC20_Msk                      /*!< Page 20 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC21_Pos                  (21UL)
#define FLASH_SECBB2R1_SEC21_Msk                  (0x1UL << FLASH_SECBB2R1_SEC21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R1_SEC21                      FLASH_SECBB2R1_SEC21_Msk                      /*!< Page 21 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC22_Pos                  (22UL)
#define FLASH_SECBB2R1_SEC22_Msk                  (0x1UL << FLASH_SECBB2R1_SEC22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R1_SEC22                      FLASH_SECBB2R1_SEC22_Msk                      /*!< Page 22 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC23_Pos                  (23UL)
#define FLASH_SECBB2R1_SEC23_Msk                  (0x1UL << FLASH_SECBB2R1_SEC23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R1_SEC23                      FLASH_SECBB2R1_SEC23_Msk                      /*!< Page 23 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC24_Pos                  (24UL)
#define FLASH_SECBB2R1_SEC24_Msk                  (0x1UL << FLASH_SECBB2R1_SEC24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R1_SEC24                      FLASH_SECBB2R1_SEC24_Msk                      /*!< Page 24 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC25_Pos                  (25UL)
#define FLASH_SECBB2R1_SEC25_Msk                  (0x1UL << FLASH_SECBB2R1_SEC25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R1_SEC25                      FLASH_SECBB2R1_SEC25_Msk                      /*!< Page 25 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC26_Pos                  (26UL)
#define FLASH_SECBB2R1_SEC26_Msk                  (0x1UL << FLASH_SECBB2R1_SEC26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R1_SEC26                      FLASH_SECBB2R1_SEC26_Msk                      /*!< Page 26 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC27_Pos                  (27UL)
#define FLASH_SECBB2R1_SEC27_Msk                  (0x1UL << FLASH_SECBB2R1_SEC27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R1_SEC27                      FLASH_SECBB2R1_SEC27_Msk                      /*!< Page 27 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC28_Pos                  (28UL)
#define FLASH_SECBB2R1_SEC28_Msk                  (0x1UL << FLASH_SECBB2R1_SEC28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R1_SEC28                      FLASH_SECBB2R1_SEC28_Msk                      /*!< Page 28 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC29_Pos                  (29UL)
#define FLASH_SECBB2R1_SEC29_Msk                  (0x1UL << FLASH_SECBB2R1_SEC29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R1_SEC29                      FLASH_SECBB2R1_SEC29_Msk                      /*!< Page 29 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC30_Pos                  (30UL)
#define FLASH_SECBB2R1_SEC30_Msk                  (0x1UL << FLASH_SECBB2R1_SEC30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R1_SEC30                      FLASH_SECBB2R1_SEC30_Msk                      /*!< Page 30 in bank 2 block-based secure */
#define FLASH_SECBB2R1_SEC31_Pos                  (31UL)
#define FLASH_SECBB2R1_SEC31_Msk                  (0x1UL << FLASH_SECBB2R1_SEC31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R1_SEC31                      FLASH_SECBB2R1_SEC31_Msk                      /*!< Page 31 in bank 2 block-based secure */

