zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
/******************  Bits definition for HASH_STR register  *******************/
#define HASH_STR_NBLW_Pos                   (0UL)
#define HASH_STR_NBLW_Msk                   (0x1FUL << HASH_STR_NBLW_Pos)           /*!< 0x0000001F */
#define HASH_STR_NBLW                       HASH_STR_NBLW_Msk
#define HASH_STR_NBLW_0                     (0x01UL << HASH_STR_NBLW_Pos)           /*!< 0x00000001 */
#define HASH_STR_NBLW_1                     (0x02UL << HASH_STR_NBLW_Pos)           /*!< 0x00000002 */
#define HASH_STR_NBLW_2                     (0x04UL << HASH_STR_NBLW_Pos)           /*!< 0x00000004 */
#define HASH_STR_NBLW_3                     (0x08UL << HASH_STR_NBLW_Pos)           /*!< 0x00000008 */
#define HASH_STR_NBLW_4                     (0x10UL << HASH_STR_NBLW_Pos)           /*!< 0x00000010 */
#define HASH_STR_DCAL_Pos                   (8UL)
#define HASH_STR_DCAL_Msk                   (0x1UL << HASH_STR_DCAL_Pos)            /*!< 0x00000100 */
#define HASH_STR_DCAL                       HASH_STR_DCAL_Msk

/******************  Bits definition for HASH_SHA3CFGR register  ********************/
#define HASH_SHA3CFGR_PADBYTE_Pos           (0UL)
#define HASH_SHA3CFGR_PADBYTE_Msk           (0xFFUL << HASH_SHA3CFGR_PADBYTE_Pos)            /*!< 0x000000FF */
#define HASH_SHA3CFGR_PADBYTE               HASH_SHA3CFGR_PADBYTE_Msk
#define HASH_SHA3CFGR_PADCONFIG_Pos         (8UL)
#define HASH_SHA3CFGR_PADCONFIG_Msk         (0x1UL << HASH_SHA3CFGR_PADCONFIG_Pos)             /*!< 0x00000100 */
#define HASH_SHA3CFGR_PADCONFIG             HASH_SHA3CFGR_PADCONFIG_Msk
#define HASH_SHA3CFGR_START_RND_Pos         (9UL)
#define HASH_SHA3CFGR_START_RND_Msk         (0x1FUL << HASH_SHA3CFGR_START_RND_Pos)             /*!< 0x00003E00 */
#define HASH_SHA3CFGR_START_RND             HASH_SHA3CFGR_START_RND_Msk
#define HASH_SHA3CFGR_END_RND_Pos           (14UL)
#define HASH_SHA3CFGR_END_RND_Msk           (0x1FUL << HASH_SHA3CFGR_END_RND_Pos)             /*!< 0x0007C000 */
#define HASH_SHA3CFGR_END_RND               HASH_SHA3CFGR_END_RND_Msk
#define HASH_SHA3CFGR_IN_RATE_Pos           (19UL)
#define HASH_SHA3CFGR_IN_RATE_Msk           (0x1FUL << HASH_SHA3CFGR_IN_RATE_Pos)             /*!< 0x0F80000 */
#define HASH_SHA3CFGR_IN_RATE               HASH_SHA3CFGR_IN_RATE_Msk

/******************  Bits definition for HASH_IMR register  *******************/
#define HASH_IMR_DINIE_Pos                  (0UL)
#define HASH_IMR_DINIE_Msk                  (0x1UL << HASH_IMR_DINIE_Pos)           /*!< 0x00000001 */
#define HASH_IMR_DINIE                      HASH_IMR_DINIE_Msk
#define HASH_IMR_DCIE_Pos                   (1UL)
#define HASH_IMR_DCIE_Msk                   (0x1UL << HASH_IMR_DCIE_Pos)            /*!< 0x00000002 */
#define HASH_IMR_DCIE                       HASH_IMR_DCIE_Msk

/******************  Bits definition for HASH_SR register  ********************/
#define HASH_SR_DINIS_Pos                   (0UL)
#define HASH_SR_DINIS_Msk                   (0x1UL << HASH_SR_DINIS_Pos)            /*!< 0x00000001 */
#define HASH_SR_DINIS                       HASH_SR_DINIS_Msk
#define HASH_SR_DCIS_Pos                    (1UL)
#define HASH_SR_DCIS_Msk                    (0x1UL << HASH_SR_DCIS_Pos)             /*!< 0x00000002 */
#define HASH_SR_DCIS                        HASH_SR_DCIS_Msk
#define HASH_SR_DMAS_Pos                    (2UL)
#define HASH_SR_DMAS_Msk                    (0x1UL << HASH_SR_DMAS_Pos)             /*!< 0x00000004 */
#define HASH_SR_DMAS                        HASH_SR_DMAS_Msk
#define HASH_SR_BUSY_Pos                    (3UL)
#define HASH_SR_BUSY_Msk                    (0x1UL << HASH_SR_BUSY_Pos)             /*!< 0x00000008 */
#define HASH_SR_BUSY                        HASH_SR_BUSY_Msk
#define HASH_SR_NBWP_Pos                    (9UL)
#define HASH_SR_NBWP_Msk                    (0x3FUL << HASH_SR_NBWP_Pos)             /*!< 0x00007E00 */
#define HASH_SR_NBWP                        HASH_SR_NBWP_Msk
#define HASH_SR_DINNE_Pos                   (15UL)
#define HASH_SR_DINNE_Msk                   (0x1UL << HASH_SR_DINNE_Pos)            /*!< 0x00008000 */
#define HASH_SR_DINNE                       HASH_SR_DINNE_Msk
#define HASH_SR_NBWE_Pos                    (16UL)
#define HASH_SR_NBWE_Msk                    (0x3FUL << HASH_SR_NBWE_Pos)             /*!< 0x000F0000 */
#define HASH_SR_NBWE                        HASH_SR_NBWE_Msk

/******************************************************************************/
/*                                                                            */
/*                      Hardware Signal Processor (HSP)                       */
/*                                                                            */
/******************************************************************************/
#define HSP_INSTANCE_NBR  1U
#define HSP_TASK_COMPARATOR_UNIT_NBR(instance)  (((instance) == HSP1)?4U:0U)
#define HSP_ADC_INTERFACE_NBR(instance)  (((instance) == HSP1)?0U:0U)
#define HSP_STREAM_INTERFACE_NBR(instance)  (((instance) == HSP1)?4U:0U)
#define HSP_TRIGGER_INTERFACE_NBR(instance)  (((instance) == HSP1)?10U:0U)

#define HSP_CDEGR_OFFSET     0x0130UL
#define HSP_DCMDIDR_OFFSET   0x0060UL
#define HSP_DCMDSR_OFFSET    0x0058UL
#define HSP_DCMDPTR0_OFFSET  0x0064UL
#define HSP_DCMDPTR1_OFFSET  0x0068UL
#define HSP_DCMDPTR2_OFFSET  0x006CUL

#define HSP1_CRAM_BASE    SRAM4_BASE
#define HSP1_CRAM_SIZE    0x00005000UL  /*!< CRAM region = 20k */
#define HSP1_DRAM_BASE    (HSP1_CRAM_BASE + HSP1_CRAM_SIZE)
#define HSP1_DRAM_SIZE    0x00003000UL  /*!< CRAM region = 12k */
#define HSP1_BRAM_BASE    (HSP1_CRAM_BASE + HSP1_CRAM_SIZE + HSP1_DRAM_SIZE)
#define HSP1_BRAMA_BASE   HSP1_BRAM_BASE
#define HSP1_BRAMA_SIZE   0x00004000UL /*!< BRAMA region = 16k */
#define HSP1_BRAMB_BASE   (HSP1_BRAMA_BASE + HSP1_BRAMA_SIZE)
#define HSP1_BRAMB_SIZE   0x00004000UL /*!< BRAMB region = 16k */
#define HSP1_BRAMAB_BASE  (HSP1_BRAM_BASE + HSP1_BRAMA_SIZE + HSP1_BRAMB_SIZE)
#define HSP1_BRAMAB_SIZE  0x00004000UL /*!< BRAMAB region = 16k */

#define HSP1_DCMDIDR_BASE    ((uint32_t)((uint32_t)HSP1 + HSP_DCMDIDR_OFFSET))
#define HSP1_DCMDSR_BASE     ((uint32_t)((uint32_t)HSP1 + HSP_DCMDSR_OFFSET))
#define HSP1_DCMDPTR0_BASE   ((uint32_t)((uint32_t)HSP1 + HSP_DCMDPTR0_OFFSET))
#define HSP1_DCMDPTR1_BASE   ((uint32_t)((uint32_t)HSP1 + HSP_DCMDPTR1_OFFSET))
#define HSP1_DCMDPTR2_BASE   ((uint32_t)((uint32_t)HSP1 + HSP_DCMDPTR2_OFFSET))
#define HSP1_PARAMR0_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x194))
#define HSP1_PARAMR1_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x198))
#define HSP1_PARAMR2_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x19C))
#define HSP1_PARAMR3_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1A0))
#define HSP1_PARAMR4_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1A4))
#define HSP1_PARAMR5_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1A8))
#define HSP1_PARAMR6_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1AC))
#define HSP1_PARAMR7_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1B0))
#define HSP1_PARAMR8_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1B4))
#define HSP1_PARAMR9_BASE    ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1B8))
#define HSP1_PARAMR10_BASE   ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1BC))
#define HSP1_PARAMR11_BASE   ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1C0))
#define HSP1_PARAMR12_BASE   ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1C4))
#define HSP1_PARAMR13_BASE   ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1C8))
#define HSP1_PARAMR14_BASE   ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1CC))
#define HSP1_PARAMR15_BASE   ((uint32_t)((uint32_t)HSP1 + (uint32_t)0x1D0))

#define HSP1_CDEGR_BASE      ((uint32_t)((uint32_t)HSP1 + HSP_CDEGR_OFFSET))

/********************  Bit definition for HSP_CR register  ********************/
#define HSP_CR_BOOTEN_Pos    (0UL)
#define HSP_CR_BOOTEN_Msk    (0x1UL << HSP_CR_BOOTEN_Pos)    /*!< 0x00000001 */
#define HSP_CR_BOOTEN        HSP_CR_BOOTEN_Msk               /*!< BOOTEN (Boot Enable control) */

#define HSP_CR_CTRLCGDIS_Pos (4UL)
#define HSP_CR_CTRLCGDIS_Msk (0x1UL << HSP_CR_CTRLCGDIS_Pos) /*!< 0x00000010 */
#define HSP_CR_CTRLCGDIS     HSP_CR_CTRLCGDIS_Msk            /*!< CTRLCGDIS (HSP_CTRL clock gating disable) */

#define HSP_CR_MMCCGDIS_Pos  (6UL)
#define HSP_CR_MMCCGDIS_Msk  (0x1UL << HSP_CR_MMCCGDIS_Pos)  /*!< 0x00000040 */
#define HSP_CR_MMCCGDIS      HSP_CR_MMCCGDIS_Msk             /*!< MMCCGDIS (MMC clock gating disable) */

