zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
#define HSP_CR_SPECGDIS_Pos  (7UL)
#define HSP_CR_SPECGDIS_Msk  (0x1UL << HSP_CR_SPECGDIS_Pos)  /*!< 0x00000080 */
#define HSP_CR_SPECGDIS      HSP_CR_SPECGDIS_Msk             /*!< SPECGDIS (SPE clock gating disable) */

#define HSP_CR_DCMDEVEN_Pos  (12UL)
#define HSP_CR_DCMDEVEN_Msk  (0x1UL << HSP_CR_DCMDEVEN_Pos)  /*!< 0x00001000 */
#define HSP_CR_DCMDEVEN      HSP_CR_DCMDEVEN_Msk             /*!< DCMDEVEN (Direct command event enable) */

#define HSP_CR_CDRLCK_Pos    (13UL)
#define HSP_CR_CDRLCK_Msk    (0x3UL << HSP_CR_CDRLCK_Pos)    /*!< 0x00006000 */
#define HSP_CR_CDRLCK        HSP_CR_CDRLCK_Msk               /*!< CDRLCK[1:0] bits (CRAM & DRAM lock access control) */
#define HSP_CR_CDRLCK_0      (0x1UL << HSP_CR_CDRLCK_Pos)    /*!< 0x00002000 */
#define HSP_CR_CDRLCK_1      (0x2UL << HSP_CR_CDRLCK_Pos)    /*!< 0x00004000 */

#define HSP_CR_REGLCK_Pos    (15UL)
#define HSP_CR_REGLCK_Msk    (0x1UL << HSP_CR_REGLCK_Pos)    /*!< 0x00008000 */
#define HSP_CR_REGLCK        HSP_CR_REGLCK_Msk               /*!< REGLCK (Register write lock access control) */

#define HSP_CR_RSTREQ_Pos    (16UL)
#define HSP_CR_RSTREQ_Msk    (0x1UL << HSP_CR_RSTREQ_Pos)    /*!< 0x00010000 */
#define HSP_CR_RSTREQ        HSP_CR_RSTREQ_Msk               /*!< RSTREQ (Reset request) */

#define HSP_CR_RSTOK_Pos     (17UL)
#define HSP_CR_RSTOK_Msk     (0x1UL << HSP_CR_RSTOK_Pos)     /*!< 0x00020000 */
#define HSP_CR_RSTOK         HSP_CR_RSTOK_Msk                /*!< RSTOK (Reset request accepted) */

#define HSP_CR_BARB_Pos      (24UL)
#define HSP_CR_BARB_Msk      (0x3UL << HSP_CR_BARB_Pos)      /*!< 0x03000000 */
#define HSP_CR_BARB          HSP_CR_BARB_Msk                 /*!< BARB[1:0] bits (BRAM Arbitration) */
#define HSP_CR_BARB_0        (0x1UL << HSP_CR_BARB_Pos)      /*!< 0x01000000 */
#define HSP_CR_BARB_1        (0x2UL << HSP_CR_BARB_Pos)      /*!< 0x02000000 */

#define HSP_CR_BSTAT_Pos     (28UL)
#define HSP_CR_BSTAT_Msk     (0xFUL << HSP_CR_BSTAT_Pos)     /*!< 0xF0000000 */
#define HSP_CR_BSTAT         HSP_CR_BSTAT_Msk                /*!< BSTAT[3:0] bits (Boot status) */
#define HSP_CR_BSTAT_0       (0x01UL << HSP_CR_BSTAT_Pos)    /*!< 0x10000000 */
#define HSP_CR_BSTAT_1       (0x02UL << HSP_CR_BSTAT_Pos)    /*!< 0x20000000 */
#define HSP_CR_BSTAT_2       (0x04UL << HSP_CR_BSTAT_Pos)    /*!< 0x40000000 */
#define HSP_CR_BSTAT_3       (0x08UL << HSP_CR_BSTAT_Pos)    /*!< 0x80000000 */

/********************  Bit definition for HSP_C2HSEMR register  ********************/
#define HSP_C2HSEMR_C2HSEM_Pos (0UL)
#define HSP_C2HSEMR_C2HSEM_Msk (0x1UL << HSP_C2HSEMR_C2HSEM_Pos) /*!< 0x00000001 */
#define HSP_C2HSEMR_C2HSEM     HSP_C2HSEMR_C2HSEM_Msk            /*!< C2HSEM (CPU to HSP semaphore) */

/********************  Bit definition for HSP_C2HMSGDR register  ********************/
#define HSP_C2HMSGDR_C2HDATA_Pos (0UL)
#define HSP_C2HMSGDR_C2HDATA_Msk (0xFFFFFFFFUL << HSP_C2HMSGDR_C2HDATA_Pos) /*!< 0xFFFFFFFF */
#define HSP_C2HMSGDR_C2HDATA     HSP_C2HMSGDR_C2HDATA_Msk                   /*!< C2HDATA[31:0] bits (CPU Message for the HSP) */

/********************  Bit definition for HSP_H2CSEMR register  ********************/
#define HSP_H2CSEMR_H2CSEM_Pos (0UL)
#define HSP_H2CSEMR_H2CSEM_Msk (0x1UL << HSP_H2CSEMR_H2CSEM_Pos) /*!< 0x00000001 */
#define HSP_H2CSEMR_H2CSEM     HSP_H2CSEMR_H2CSEM_Msk            /*!< H2CSEM (HSP to CPU semaphore) */

/********************  Bit definition for HSP_H2CMSGDR register  ********************/
#define HSP_H2CMSGDR_H2CDATA_Pos (0UL)
#define HSP_H2CMSGDR_H2CDATA_Msk (0xFFFFFFFFUL << HSP_H2CMSGDR_H2CDATA_Pos) /*!< 0xFFFFFFFF */
#define HSP_H2CMSGDR_H2CDATA     HSP_H2CMSGDR_H2CDATA_Msk                   /*!< H2CDATA[31:0] bits (HSP Message for the CPU) */

/********************  Bit definition for HSP_DCMDSR register  ********************/
#define HSP_DCMDSR_DCBSY_Pos (0UL)
#define HSP_DCMDSR_DCBSY_Msk (0x1UL << HSP_DCMDSR_DCBSY_Pos) /*!< 0x00000001 */
#define HSP_DCMDSR_DCBSY     HSP_DCMDSR_DCBSY_Msk            /*!< DCBSY (Direct command busy flag) */

/********************  Bit definition for HSP_DCMDPTSR register  ********************/
#define HSP_DCMDPTSR_PTRF0_Pos (0UL)
#define HSP_DCMDPTSR_PTRF0_Msk (0x1UL << HSP_DCMDPTSR_PTRF0_Pos) /*!< 0x00000001 */
#define HSP_DCMDPTSR_PTRF0     HSP_DCMDPTSR_PTRF0_Msk            /*!< PTRF0 (Address pointer 0 flag) */

#define HSP_DCMDPTSR_PTRF1_Pos (1UL)
#define HSP_DCMDPTSR_PTRF1_Msk (0x1UL << HSP_DCMDPTSR_PTRF1_Pos) /*!< 0x00000002 */
#define HSP_DCMDPTSR_PTRF1     HSP_DCMDPTSR_PTRF1_Msk            /*!< PTRF1 (Address pointer 1 flag) */

#define HSP_DCMDPTSR_PTRF2_Pos (2UL)
#define HSP_DCMDPTSR_PTRF2_Msk (0x1UL << HSP_DCMDPTSR_PTRF2_Pos) /*!< 0x00000004 */
#define HSP_DCMDPTSR_PTRF2     HSP_DCMDPTSR_PTRF2_Msk            /*!< PTRF2 (Address pointer 2 flag) */

#define HSP_DCMDPTSR_RDOG_Pos  (15UL)
#define HSP_DCMDPTSR_RDOG_Msk  (0x1UL << HSP_DCMDPTSR_RDOG_Pos)  /*!< 0x00008000 */
#define HSP_DCMDPTSR_RDOG      HSP_DCMDPTSR_RDOG_Msk             /*!< RDOG (Read on-going indicator) */

/********************  Bit definition for HSP_DCMDIDR register  ********************/
#define HSP_DCMDIDR_CMDID_Pos (0UL)
#define HSP_DCMDIDR_CMDID_Msk (0xFFFFUL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x0000FFFF */
#define HSP_DCMDIDR_CMDID     HSP_DCMDIDR_CMDID_Msk               /*!< CMDID[15:0] bits (Command ID) */

/********************  Bit definition for HSP_DCMDPTR0 register  ********************/
#define HSP_DCMDPTR0_PTCPU_Pos (0UL)
#define HSP_DCMDPTR0_PTCPU_Msk (0xFFFFFFFFUL << HSP_DCMDPTR0_PTCPU_Pos) /*!< 0xFFFFFFFF */
#define HSP_DCMDPTR0_PTCPU     HSP_DCMDPTR0_PTCPU_Msk                   /*!< PTCPU[31:0] bits (Address pointer value) */

/********************  Bit definition for HSP_DCMDPTR1 register  ********************/
#define HSP_DCMDPTR1_PTCPU_Pos (0UL)
#define HSP_DCMDPTR1_PTCPU_Msk (0xFFFFFFFFUL << HSP_DCMDPTR1_PTCPU_Pos) /*!< 0xFFFFFFFF */
#define HSP_DCMDPTR1_PTCPU     HSP_DCMDPTR1_PTCPU_Msk                   /*!< PTCPU[31:0] bits (Address pointer value) */

/********************  Bit definition for HSP_DCMDPTR2 register  ********************/
#define HSP_DCMDPTR2_PTCPU_Pos (0UL)
#define HSP_DCMDPTR2_PTCPU_Msk (0xFFFFFFFFUL << HSP_DCMDPTR2_PTCPU_Pos) /*!< 0xFFFFFFFF */
#define HSP_DCMDPTR2_PTCPU     HSP_DCMDPTR2_PTCPU_Msk                   /*!< PTCPU[31:0] bits (Address pointer value) */

/********************  Bit definition for HSP_EVTENR register  ********************/
#define HSP_EVTENR_EVTEN_Pos (1UL)
#define HSP_EVTENR_EVTEN_Msk (0x3FFFFFUL << HSP_EVTENR_EVTEN_Pos) /*!< 0x007FFFFE */
#define HSP_EVTENR_EVTEN     HSP_EVTENR_EVTEN_Msk                 /*!< EVTEN[21:0] bits (Events enable) */
#define HSP_EVTENR_EVTEN_0   (0x0001UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000002 */
#define HSP_EVTENR_EVTEN_1   (0x0002UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000004 */
#define HSP_EVTENR_EVTEN_2   (0x0004UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000008 */
#define HSP_EVTENR_EVTEN_3   (0x0008UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000010 */
#define HSP_EVTENR_EVTEN_4   (0x0010UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000020 */
#define HSP_EVTENR_EVTEN_5   (0x0020UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000040 */
#define HSP_EVTENR_EVTEN_6   (0x0040UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000080 */
#define HSP_EVTENR_EVTEN_7   (0x0080UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000100 */
#define HSP_EVTENR_EVTEN_8   (0x0100UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000200 */
#define HSP_EVTENR_EVTEN_9   (0x0200UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000400 */
#define HSP_EVTENR_EVTEN_10  (0x0400UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000800 */
#define HSP_EVTENR_EVTEN_11  (0x0800UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00001000 */
#define HSP_EVTENR_EVTEN_12  (0x1000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00002000 */
#define HSP_EVTENR_EVTEN_13  (0x2000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00004000 */
#define HSP_EVTENR_EVTEN_14  (0x4000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00008000 */
#define HSP_EVTENR_EVTEN_15  (0x8000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00010000 */
#define HSP_EVTENR_EVTEN_16  (0x10000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00020000 */
#define HSP_EVTENR_EVTEN_17  (0x20000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00040000 */
#define HSP_EVTENR_EVTEN_18  (0x40000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00080000 */
#define HSP_EVTENR_EVTEN_19  (0x80000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00100000 */
#define HSP_EVTENR_EVTEN_20  (0x100000UL << HSP_EVTENR_EVTEN_Pos) /*!< 0x00200000 */
#define HSP_EVTENR_EVTEN_21  (0x200000UL << HSP_EVTENR_EVTEN_Pos) /*!< 0x00400000 */

/********************  Bit definition for HSP_ESYNCENR register  ********************/
#define HSP_ESYNCENR_EVTSYNCEN_Pos  (1UL)
#define HSP_ESYNCENR_EVTSYNCEN_Msk  (0x3FFFFFUL << HSP_ESYNCENR_EVTSYNCEN_Pos) /*!< 0x007FFFFE */
#define HSP_ESYNCENR_EVTSYNCEN      HSP_ESYNCENR_EVTSYNCEN_Msk                 /*!< EVTSYNCEN[21:0] bits (Event synchronization enable) */
#define HSP_ESYNCENR_EVTSYNCEN_0    (0x0001UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000002 */
#define HSP_ESYNCENR_EVTSYNCEN_1    (0x0002UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000004 */
#define HSP_ESYNCENR_EVTSYNCEN_2    (0x0004UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000008 */
#define HSP_ESYNCENR_EVTSYNCEN_3    (0x0008UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000010 */
#define HSP_ESYNCENR_EVTSYNCEN_4    (0x0010UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000020 */
#define HSP_ESYNCENR_EVTSYNCEN_5    (0x0020UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000040 */
#define HSP_ESYNCENR_EVTSYNCEN_6    (0x0040UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000080 */
#define HSP_ESYNCENR_EVTSYNCEN_7    (0x0080UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000100 */
#define HSP_ESYNCENR_EVTSYNCEN_8    (0x0100UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000200 */
#define HSP_ESYNCENR_EVTSYNCEN_9    (0x0200UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000400 */
#define HSP_ESYNCENR_EVTSYNCEN_10   (0x0400UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000800 */
#define HSP_ESYNCENR_EVTSYNCEN_11   (0x0800UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00001000 */
#define HSP_ESYNCENR_EVTSYNCEN_12   (0x1000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00002000 */
#define HSP_ESYNCENR_EVTSYNCEN_13   (0x2000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00004000 */
#define HSP_ESYNCENR_EVTSYNCEN_14   (0x4000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00008000 */
#define HSP_ESYNCENR_EVTSYNCEN_15   (0x8000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00010000 */
#define HSP_ESYNCENR_EVTSYNCEN_16   (0x10000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00020000 */
#define HSP_ESYNCENR_EVTSYNCEN_17   (0x20000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00040000 */
#define HSP_ESYNCENR_EVTSYNCEN_18   (0x40000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00080000 */
#define HSP_ESYNCENR_EVTSYNCEN_19   (0x80000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00100000 */
#define HSP_ESYNCENR_EVTSYNCEN_20   (0x100000UL << HSP_ESYNCENR_EVTSYNCEN_Pos) /*!< 0x00200000 */
#define HSP_ESYNCENR_EVTSYNCEN_21   (0x200000UL << HSP_ESYNCENR_EVTSYNCEN_Pos) /*!< 0x00400000 */

#define HSP_ESYNCENR_CDEGSYNCEN_Pos (26UL)
#define HSP_ESYNCENR_CDEGSYNCEN_Msk (0x1UL << HSP_ESYNCENR_CDEGSYNCEN_Pos)     /*!< 0x04000000 */
#define HSP_ESYNCENR_CDEGSYNCEN     HSP_ESYNCENR_CDEGSYNCEN_Msk                /*!< CDEGSYNCEN (CPU dedicated event synchronization enable) */

/********************  Bit definition for HSP_ESYNC0SRCR register  ********************/

#define HSP_ESYNC0SRCR_EV1SSRC_Pos (0UL)
#define HSP_ESYNC0SRCR_EV1SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV1SSRC_Pos) /*!< 0x00000003 */
#define HSP_ESYNC0SRCR_EV1SSRC     HSP_ESYNC0SRCR_EV1SSRC_Msk            /*!< EV1SSRC[1:0] bits (Event 1 synchronization source) */
#define HSP_ESYNC0SRCR_EV1SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV1SSRC_Pos) /*!< 0x00000001 */
#define HSP_ESYNC0SRCR_EV1SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV1SSRC_Pos) /*!< 0x00000002 */

#define HSP_ESYNC0SRCR_EV2SSRC_Pos (4UL)
#define HSP_ESYNC0SRCR_EV2SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV2SSRC_Pos) /*!< 0x00000030 */
#define HSP_ESYNC0SRCR_EV2SSRC     HSP_ESYNC0SRCR_EV2SSRC_Msk            /*!< EV2SSRC[1:0] bits (Event 2 synchronization source) */
#define HSP_ESYNC0SRCR_EV2SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV2SSRC_Pos) /*!< 0x00000010 */
#define HSP_ESYNC0SRCR_EV2SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV2SSRC_Pos) /*!< 0x00000020 */

#define HSP_ESYNC0SRCR_EV3SSRC_Pos (8UL)
#define HSP_ESYNC0SRCR_EV3SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV3SSRC_Pos) /*!< 0x00000300 */
#define HSP_ESYNC0SRCR_EV3SSRC     HSP_ESYNC0SRCR_EV3SSRC_Msk            /*!< EV3SSRC[1:0] bits (Event 3 synchronization source) */
#define HSP_ESYNC0SRCR_EV3SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV3SSRC_Pos) /*!< 0x00000100 */
#define HSP_ESYNC0SRCR_EV3SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV3SSRC_Pos) /*!< 0x00000200 */

