zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
#define HSP_ITFENR_TRGI3EN_Pos  (19UL)
#define HSP_ITFENR_TRGI3EN_Msk  (0x1UL << HSP_ITFENR_TRGI3EN_Pos)  /*!< 0x00080000 */
#define HSP_ITFENR_TRGI3EN      HSP_ITFENR_TRGI3EN_Msk             /*!< TRGI3EN (TRGIN3 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI4EN_Pos  (20UL)
#define HSP_ITFENR_TRGI4EN_Msk  (0x1UL << HSP_ITFENR_TRGI4EN_Pos)  /*!< 0x00100000 */
#define HSP_ITFENR_TRGI4EN      HSP_ITFENR_TRGI4EN_Msk             /*!< TRGI4EN (TRGIN4 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI5EN_Pos  (21UL)
#define HSP_ITFENR_TRGI5EN_Msk  (0x1UL << HSP_ITFENR_TRGI5EN_Pos)  /*!< 0x00200000 */
#define HSP_ITFENR_TRGI5EN      HSP_ITFENR_TRGI5EN_Msk             /*!< TRGI5EN (TRGIN5 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI6EN_Pos  (22UL)
#define HSP_ITFENR_TRGI6EN_Msk  (0x1UL << HSP_ITFENR_TRGI6EN_Pos)  /*!< 0x00400000 */
#define HSP_ITFENR_TRGI6EN      HSP_ITFENR_TRGI6EN_Msk             /*!< TRGI6EN (TRGIN6 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI7EN_Pos  (23UL)
#define HSP_ITFENR_TRGI7EN_Msk  (0x1UL << HSP_ITFENR_TRGI7EN_Pos)  /*!< 0x00800000 */
#define HSP_ITFENR_TRGI7EN      HSP_ITFENR_TRGI7EN_Msk             /*!< TRGI7EN (TRGIN7 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI8EN_Pos  (24UL)
#define HSP_ITFENR_TRGI8EN_Msk  (0x1UL << HSP_ITFENR_TRGI8EN_Pos)  /*!< 0x01000000 */
#define HSP_ITFENR_TRGI8EN      HSP_ITFENR_TRGI8EN_Msk             /*!< TRGI8EN (TRGIN8 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI9EN_Pos  (25UL)
#define HSP_ITFENR_TRGI9EN_Msk  (0x1UL << HSP_ITFENR_TRGI9EN_Pos)  /*!< 0x02000000 */
#define HSP_ITFENR_TRGI9EN      HSP_ITFENR_TRGI9EN_Msk             /*!< TRGI9EN (TRGIN9 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_DCMDDIS_Pos  (27UL)
#define HSP_ITFENR_DCMDDIS_Msk  (0x1UL << HSP_ITFENR_DCMDDIS_Pos)  /*!< 0x08000000 */
#define HSP_ITFENR_DCMDDIS      HSP_ITFENR_DCMDDIS_Msk             /*!< DCMDDIS (Direct command interface disable bit ) */

#define HSP_ITFENR_CSEGEN_Pos   (28UL)
#define HSP_ITFENR_CSEGEN_Msk   (0x1UL << HSP_ITFENR_CSEGEN_Pos)   /*!< 0x10000000 */
#define HSP_ITFENR_CSEGEN       HSP_ITFENR_CSEGEN_Msk              /*!< CSEGEN (CSEG interface enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_CDEGEN_Pos   (29UL)
#define HSP_ITFENR_CDEGEN_Msk   (0x1UL << HSP_ITFENR_CDEGEN_Pos)   /*!< 0x20000000 */
#define HSP_ITFENR_CDEGEN       HSP_ITFENR_CDEGEN_Msk              /*!< CDEGEN (CDEG interface enable bit ) */

#define HSP_ITFENR_HSEGEN_Pos   (30UL)
#define HSP_ITFENR_HSEGEN_Msk   (0x1UL << HSP_ITFENR_HSEGEN_Pos)   /*!< 0x40000000 */
#define HSP_ITFENR_HSEGEN       HSP_ITFENR_HSEGEN_Msk              /*!< HSEGEN (HSEG interface enable bit ) */

#define HSP_ITFENR_HDEGEN_Pos   (31UL)
#define HSP_ITFENR_HDEGEN_Msk   (0x1UL << HSP_ITFENR_HDEGEN_Pos)   /*!< 0x80000000 */
#define HSP_ITFENR_HDEGEN       HSP_ITFENR_HDEGEN_Msk              /*!< HDEGEN (HDEG interface enable bit ) */

/********************  Bit definition for HSP_EVTSRC0R register  ********************/
#define HSP_EVTSRC0R_EVT1SRC_Pos (0UL)
#define HSP_EVTSRC0R_EVT1SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000007 */
#define HSP_EVTSRC0R_EVT1SRC     HSP_EVTSRC0R_EVT1SRC_Msk            /*!< EVT1SRC[2:0] bits (Event source selection for priority encoder input 1) */
#define HSP_EVTSRC0R_EVT1SRC_0   (0x1UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000001 */
#define HSP_EVTSRC0R_EVT1SRC_1   (0x2UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000002 */
#define HSP_EVTSRC0R_EVT1SRC_2   (0x4UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000004 */

#define HSP_EVTSRC0R_EVT2SRC_Pos (4UL)
#define HSP_EVTSRC0R_EVT2SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000070 */
#define HSP_EVTSRC0R_EVT2SRC     HSP_EVTSRC0R_EVT2SRC_Msk            /*!< EVT2SRC[2:0] bits (Event source selection for priority encoder input 2) */
#define HSP_EVTSRC0R_EVT2SRC_0   (0x1UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000010 */
#define HSP_EVTSRC0R_EVT2SRC_1   (0x2UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000020 */
#define HSP_EVTSRC0R_EVT2SRC_2   (0x4UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000040 */

#define HSP_EVTSRC0R_EVT3SRC_Pos (8UL)
#define HSP_EVTSRC0R_EVT3SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000700 */
#define HSP_EVTSRC0R_EVT3SRC     HSP_EVTSRC0R_EVT3SRC_Msk            /*!< EVT3SRC[2:0] bits (Event source selection for priority encoder input 3) */
#define HSP_EVTSRC0R_EVT3SRC_0   (0x1UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000100 */
#define HSP_EVTSRC0R_EVT3SRC_1   (0x2UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000200 */
#define HSP_EVTSRC0R_EVT3SRC_2   (0x4UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000400 */

#define HSP_EVTSRC0R_EVT4SRC_Pos (12UL)
#define HSP_EVTSRC0R_EVT4SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00007000 */
#define HSP_EVTSRC0R_EVT4SRC     HSP_EVTSRC0R_EVT4SRC_Msk            /*!< EVT4SRC[2:0] bits (Event source selection for priority encoder input 4) */
#define HSP_EVTSRC0R_EVT4SRC_0   (0x1UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00001000 */
#define HSP_EVTSRC0R_EVT4SRC_1   (0x2UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00002000 */
#define HSP_EVTSRC0R_EVT4SRC_2   (0x4UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00004000 */

#define HSP_EVTSRC0R_EVT5SRC_Pos (16UL)
#define HSP_EVTSRC0R_EVT5SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00070000 */
#define HSP_EVTSRC0R_EVT5SRC     HSP_EVTSRC0R_EVT5SRC_Msk            /*!< EVT5SRC[2:0] bits (Event source selection for priority encoder input 5) */
#define HSP_EVTSRC0R_EVT5SRC_0   (0x1UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00010000 */
#define HSP_EVTSRC0R_EVT5SRC_1   (0x2UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00020000 */
#define HSP_EVTSRC0R_EVT5SRC_2   (0x4UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00040000 */

#define HSP_EVTSRC0R_EVT6SRC_Pos (20UL)
#define HSP_EVTSRC0R_EVT6SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00700000 */
#define HSP_EVTSRC0R_EVT6SRC     HSP_EVTSRC0R_EVT6SRC_Msk            /*!< EVT6SRC[2:0] bits (Event source selection for priority encoder input 6) */
#define HSP_EVTSRC0R_EVT6SRC_0   (0x1UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00100000 */
#define HSP_EVTSRC0R_EVT6SRC_1   (0x2UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00200000 */
#define HSP_EVTSRC0R_EVT6SRC_2   (0x4UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00400000 */

#define HSP_EVTSRC0R_EVT7SRC_Pos (24UL)
#define HSP_EVTSRC0R_EVT7SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x07000000 */
#define HSP_EVTSRC0R_EVT7SRC     HSP_EVTSRC0R_EVT7SRC_Msk            /*!< EVT7SRC[2:0] bits (Event source selection for priority encoder input 7) */
#define HSP_EVTSRC0R_EVT7SRC_0   (0x1UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x01000000 */
#define HSP_EVTSRC0R_EVT7SRC_1   (0x2UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x02000000 */
#define HSP_EVTSRC0R_EVT7SRC_2   (0x4UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x04000000 */

#define HSP_EVTSRC0R_EVT8SRC_Pos (28UL)
#define HSP_EVTSRC0R_EVT8SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x70000000 */
#define HSP_EVTSRC0R_EVT8SRC     HSP_EVTSRC0R_EVT8SRC_Msk            /*!< EVT8SRC[2:0] bits (Event source selection for priority encoder input 8) */
#define HSP_EVTSRC0R_EVT8SRC_0   (0x1UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x10000000 */
#define HSP_EVTSRC0R_EVT8SRC_1   (0x2UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x20000000 */
#define HSP_EVTSRC0R_EVT8SRC_2   (0x4UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x40000000 */

/********************  Bit definition for HSP_EVTSRC1R register  ********************/
#define HSP_EVTSRC1R_EVT9SRC_Pos  (0UL)
#define HSP_EVTSRC1R_EVT9SRC_Msk  (0x7UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000007 */
#define HSP_EVTSRC1R_EVT9SRC      HSP_EVTSRC1R_EVT9SRC_Msk             /*!< EVT9SRC[2:0] bits (Event source selection for priority encoder input 9) */
#define HSP_EVTSRC1R_EVT9SRC_0    (0x1UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000001 */
#define HSP_EVTSRC1R_EVT9SRC_1    (0x2UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000002 */
#define HSP_EVTSRC1R_EVT9SRC_2    (0x4UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000004 */

