zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
#define HSP_EVTSRC1R_EVT10SRC_Pos (4UL)
#define HSP_EVTSRC1R_EVT10SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000070 */
#define HSP_EVTSRC1R_EVT10SRC     HSP_EVTSRC1R_EVT10SRC_Msk            /*!< EVT10SRC[2:0] bits (Event source selection for priority encoder input 10) */
#define HSP_EVTSRC1R_EVT10SRC_0   (0x1UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000010 */
#define HSP_EVTSRC1R_EVT10SRC_1   (0x2UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000020 */
#define HSP_EVTSRC1R_EVT10SRC_2   (0x4UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000040 */

#define HSP_EVTSRC1R_EVT11SRC_Pos (8UL)
#define HSP_EVTSRC1R_EVT11SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000700 */
#define HSP_EVTSRC1R_EVT11SRC     HSP_EVTSRC1R_EVT11SRC_Msk            /*!< EVT11SRC[2:0] bits (Event source selection for priority encoder input 11) */
#define HSP_EVTSRC1R_EVT11SRC_0   (0x1UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000100 */
#define HSP_EVTSRC1R_EVT11SRC_1   (0x2UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000200 */
#define HSP_EVTSRC1R_EVT11SRC_2   (0x4UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000400 */

#define HSP_EVTSRC1R_EVT12SRC_Pos (12UL)
#define HSP_EVTSRC1R_EVT12SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00007000 */
#define HSP_EVTSRC1R_EVT12SRC     HSP_EVTSRC1R_EVT12SRC_Msk            /*!< EVT12SRC[2:0] bits (Event source selection for priority encoder input 12) */
#define HSP_EVTSRC1R_EVT12SRC_0   (0x1UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00001000 */
#define HSP_EVTSRC1R_EVT12SRC_1   (0x2UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00002000 */
#define HSP_EVTSRC1R_EVT12SRC_2   (0x4UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00004000 */

#define HSP_EVTSRC1R_EVT13SRC_Pos (16UL)
#define HSP_EVTSRC1R_EVT13SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00070000 */
#define HSP_EVTSRC1R_EVT13SRC     HSP_EVTSRC1R_EVT13SRC_Msk            /*!< EVT13SRC[2:0] bits (Event source selection for priority encoder input 13) */
#define HSP_EVTSRC1R_EVT13SRC_0   (0x1UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00010000 */
#define HSP_EVTSRC1R_EVT13SRC_1   (0x2UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00020000 */
#define HSP_EVTSRC1R_EVT13SRC_2   (0x4UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00040000 */

#define HSP_EVTSRC1R_EVT14SRC_Pos (20UL)
#define HSP_EVTSRC1R_EVT14SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00700000 */
#define HSP_EVTSRC1R_EVT14SRC     HSP_EVTSRC1R_EVT14SRC_Msk            /*!< EVT14SRC[2:0] bits (Event source selection for priority encoder input 14) */
#define HSP_EVTSRC1R_EVT14SRC_0   (0x1UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00100000 */
#define HSP_EVTSRC1R_EVT14SRC_1   (0x2UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00200000 */
#define HSP_EVTSRC1R_EVT14SRC_2   (0x4UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00400000 */

#define HSP_EVTSRC1R_EVT15SRC_Pos (24UL)
#define HSP_EVTSRC1R_EVT15SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x07000000 */
#define HSP_EVTSRC1R_EVT15SRC     HSP_EVTSRC1R_EVT15SRC_Msk            /*!< EVT15SRC[2:0] bits (Event source selection for priority encoder input 15) */
#define HSP_EVTSRC1R_EVT15SRC_0   (0x1UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x01000000 */
#define HSP_EVTSRC1R_EVT15SRC_1   (0x2UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x02000000 */
#define HSP_EVTSRC1R_EVT15SRC_2   (0x4UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x04000000 */

#define HSP_EVTSRC1R_EVT16SRC_Pos (28UL)
#define HSP_EVTSRC1R_EVT16SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x70000000 */
#define HSP_EVTSRC1R_EVT16SRC     HSP_EVTSRC1R_EVT16SRC_Msk            /*!< EVT16SRC[2:0] bits (Event source selection for priority encoder input 16) */
#define HSP_EVTSRC1R_EVT16SRC_0   (0x1UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x10000000 */
#define HSP_EVTSRC1R_EVT16SRC_1   (0x2UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x20000000 */
#define HSP_EVTSRC1R_EVT16SRC_2   (0x4UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x40000000 */

/********************  Bit definition for HSP_EVTSRC2R register  ********************/
#define HSP_EVTSRC2R_EVT17SRC_Pos (0UL)
#define HSP_EVTSRC2R_EVT17SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000007 */
#define HSP_EVTSRC2R_EVT17SRC     HSP_EVTSRC2R_EVT17SRC_Msk            /*!< EVT17SRC[2:0] bits (Event source selection for priority encoder input 17) */
#define HSP_EVTSRC2R_EVT17SRC_0   (0x1UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000001 */
#define HSP_EVTSRC2R_EVT17SRC_1   (0x2UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000002 */
#define HSP_EVTSRC2R_EVT17SRC_2   (0x4UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000004 */

#define HSP_EVTSRC2R_EVT18SRC_Pos (4UL)
#define HSP_EVTSRC2R_EVT18SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000070 */
#define HSP_EVTSRC2R_EVT18SRC     HSP_EVTSRC2R_EVT18SRC_Msk            /*!< EVT18SRC[2:0] bits (Event source selection for priority encoder input 18) */
#define HSP_EVTSRC2R_EVT18SRC_0   (0x1UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000010 */
#define HSP_EVTSRC2R_EVT18SRC_1   (0x2UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000020 */
#define HSP_EVTSRC2R_EVT18SRC_2   (0x4UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000040 */

#define HSP_EVTSRC2R_EVT19SRC_Pos (8UL)
#define HSP_EVTSRC2R_EVT19SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000700 */
#define HSP_EVTSRC2R_EVT19SRC     HSP_EVTSRC2R_EVT19SRC_Msk            /*!< EVT19SRC[2:0] bits (Event source selection for priority encoder input 19) */
#define HSP_EVTSRC2R_EVT19SRC_0   (0x1UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000100 */
#define HSP_EVTSRC2R_EVT19SRC_1   (0x2UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000200 */
#define HSP_EVTSRC2R_EVT19SRC_2   (0x4UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000400 */

#define HSP_EVTSRC2R_EVT20SRC_Pos (12UL)
#define HSP_EVTSRC2R_EVT20SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00007000 */
#define HSP_EVTSRC2R_EVT20SRC     HSP_EVTSRC2R_EVT20SRC_Msk            /*!< EVT20SRC[2:0] bits (Event source selection for priority encoder input 20) */
#define HSP_EVTSRC2R_EVT20SRC_0   (0x1UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00001000 */
#define HSP_EVTSRC2R_EVT20SRC_1   (0x2UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00002000 */
#define HSP_EVTSRC2R_EVT20SRC_2   (0x4UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00004000 */

#define HSP_EVTSRC2R_EVT21SRC_Pos (16UL)
#define HSP_EVTSRC2R_EVT21SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00070000 */
#define HSP_EVTSRC2R_EVT21SRC     HSP_EVTSRC2R_EVT21SRC_Msk            /*!< EVT21SRC[2:0] bits (Event source selection for priority encoder input 21) */
#define HSP_EVTSRC2R_EVT21SRC_0   (0x1UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00010000 */
#define HSP_EVTSRC2R_EVT21SRC_1   (0x2UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00020000 */
#define HSP_EVTSRC2R_EVT21SRC_2   (0x4UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00040000 */

#define HSP_EVTSRC2R_EVT22SRC_Pos (20UL)
#define HSP_EVTSRC2R_EVT22SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00700000 */
#define HSP_EVTSRC2R_EVT22SRC     HSP_EVTSRC2R_EVT22SRC_Msk            /*!< EVT22SRC[2:0] bits (Event source selection for priority encoder input 22) */
#define HSP_EVTSRC2R_EVT22SRC_0   (0x1UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00100000 */
#define HSP_EVTSRC2R_EVT22SRC_1   (0x2UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00200000 */
#define HSP_EVTSRC2R_EVT22SRC_2   (0x4UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00400000 */

