zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
/********************  Bit definition for HSP_BUFFCFGR register  ********************/
#define HSP_BUFFCFGR_BUFF0DIR_Pos (0UL)
#define HSP_BUFFCFGR_BUFF0DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF0DIR_Pos) /*!< 0x00000001 */
#define HSP_BUFFCFGR_BUFF0DIR     HSP_BUFFCFGR_BUFF0DIR_Msk            /*!< BUFF0DIR (Direction selection of BUFF0 <sup>(1)</sup>) */

#define HSP_BUFFCFGR_BUFF1DIR_Pos (1UL)
#define HSP_BUFFCFGR_BUFF1DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF1DIR_Pos) /*!< 0x00000002 */
#define HSP_BUFFCFGR_BUFF1DIR     HSP_BUFFCFGR_BUFF1DIR_Msk            /*!< BUFF1DIR (Direction selection of BUFF1 <sup>(1)</sup>) */

#define HSP_BUFFCFGR_BUFF2DIR_Pos (2UL)
#define HSP_BUFFCFGR_BUFF2DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF2DIR_Pos) /*!< 0x00000004 */
#define HSP_BUFFCFGR_BUFF2DIR     HSP_BUFFCFGR_BUFF2DIR_Msk            /*!< BUFF2DIR (Direction selection of BUFF2 <sup>(1)</sup>) */

#define HSP_BUFFCFGR_BUFF3DIR_Pos (3UL)
#define HSP_BUFFCFGR_BUFF3DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF3DIR_Pos) /*!< 0x00000008 */
#define HSP_BUFFCFGR_BUFF3DIR     HSP_BUFFCFGR_BUFF3DIR_Msk            /*!< BUFF3DIR (Direction selection of BUFF3 <sup>(1)</sup>) */

#define HSP_BUFFCFGR_I2FEN_Pos    (8UL)
#define HSP_BUFFCFGR_I2FEN_Msk    (0x1UL << HSP_BUFFCFGR_I2FEN_Pos)    /*!< 0x00000100 */
#define HSP_BUFFCFGR_I2FEN        HSP_BUFFCFGR_I2FEN_Msk               /*!< I2FEN (integer to float32 conversion <sup>(1)</sup>) */

#define HSP_BUFFCFGR_COMB0_Pos    (16UL)
#define HSP_BUFFCFGR_COMB0_Msk    (0x1UL << HSP_BUFFCFGR_COMB0_Pos)    /*!< 0x00010000 */
#define HSP_BUFFCFGR_COMB0        HSP_BUFFCFGR_COMB0_Msk               /*!< COMB0 (BUFCMB control for buff_evt[0] <sup>(1)</sup>) */

#define HSP_BUFFCFGR_COMB1_Pos    (17UL)
#define HSP_BUFFCFGR_COMB1_Msk    (0x1UL << HSP_BUFFCFGR_COMB1_Pos)    /*!< 0x00020000 */
#define HSP_BUFFCFGR_COMB1        HSP_BUFFCFGR_COMB1_Msk               /*!< COMB1 (BUFCMB control for buff_evt[1] <sup>(1)</sup>) */

#define HSP_BUFFCFGR_COMB2_Pos    (18UL)
#define HSP_BUFFCFGR_COMB2_Msk    (0x1UL << HSP_BUFFCFGR_COMB2_Pos)    /*!< 0x00040000 */
#define HSP_BUFFCFGR_COMB2        HSP_BUFFCFGR_COMB2_Msk               /*!< COMB2 (BUFCMB control for buff_evt[2] ) */

/********************  Bit definition for HSP_BUFFxDR register  ********************/
#define HSP_BUFFDR_BUFFDAT_Pos (0UL)
#define HSP_BUFFDR_BUFFDAT_Msk (0xFFFFFFFFUL << HSP_BUFFDR_BUFFDAT_Pos) /*!< 0xFFFFFFFF */
#define HSP_BUFFDR_BUFFDAT     HSP_BUFFDR_BUFFDAT_Msk                   /*!< BUFFDAT[31:0] bits (Data buffer) */

/********************  Bit definition for HSP_TRGINCFGR register  ********************/
#define HSP_TRGINCFGR_TRG0POL_Pos (0UL)
#define HSP_TRGINCFGR_TRG0POL_Msk (0x1UL << HSP_TRGINCFGR_TRG0POL_Pos) /*!< 0x00000001 */
#define HSP_TRGINCFGR_TRG0POL     HSP_TRGINCFGR_TRG0POL_Msk            /*!< TRG0POL (Polarity selection for TRGIN0) */

#define HSP_TRGINCFGR_TRG1POL_Pos (1UL)
#define HSP_TRGINCFGR_TRG1POL_Msk (0x1UL << HSP_TRGINCFGR_TRG1POL_Pos) /*!< 0x00000002 */
#define HSP_TRGINCFGR_TRG1POL     HSP_TRGINCFGR_TRG1POL_Msk            /*!< TRG1POL (Polarity selection for TRGIN1) */

#define HSP_TRGINCFGR_TRG2POL_Pos (2UL)
#define HSP_TRGINCFGR_TRG2POL_Msk (0x1UL << HSP_TRGINCFGR_TRG2POL_Pos) /*!< 0x00000004 */
#define HSP_TRGINCFGR_TRG2POL     HSP_TRGINCFGR_TRG2POL_Msk            /*!< TRG2POL (Polarity selection for TRGIN2) */

#define HSP_TRGINCFGR_TRG3POL_Pos (3UL)
#define HSP_TRGINCFGR_TRG3POL_Msk (0x1UL << HSP_TRGINCFGR_TRG3POL_Pos) /*!< 0x00000008 */
#define HSP_TRGINCFGR_TRG3POL     HSP_TRGINCFGR_TRG3POL_Msk            /*!< TRG3POL (Polarity selection for TRGIN3) */

#define HSP_TRGINCFGR_TRG4POL_Pos (4UL)
#define HSP_TRGINCFGR_TRG4POL_Msk (0x1UL << HSP_TRGINCFGR_TRG4POL_Pos) /*!< 0x00000010 */
#define HSP_TRGINCFGR_TRG4POL     HSP_TRGINCFGR_TRG4POL_Msk            /*!< TRG4POL (Polarity selection for TRGIN4) */

#define HSP_TRGINCFGR_TRG5POL_Pos (5UL)
#define HSP_TRGINCFGR_TRG5POL_Msk (0x1UL << HSP_TRGINCFGR_TRG5POL_Pos) /*!< 0x00000020 */
#define HSP_TRGINCFGR_TRG5POL     HSP_TRGINCFGR_TRG5POL_Msk            /*!< TRG5POL (Polarity selection for TRGIN5) */

#define HSP_TRGINCFGR_TRG6POL_Pos (6UL)
#define HSP_TRGINCFGR_TRG6POL_Msk (0x1UL << HSP_TRGINCFGR_TRG6POL_Pos) /*!< 0x00000040 */
#define HSP_TRGINCFGR_TRG6POL     HSP_TRGINCFGR_TRG6POL_Msk            /*!< TRG6POL (Polarity selection for TRGIN6) */

#define HSP_TRGINCFGR_TRG7POL_Pos (7UL)
#define HSP_TRGINCFGR_TRG7POL_Msk (0x1UL << HSP_TRGINCFGR_TRG7POL_Pos) /*!< 0x00000080 */
#define HSP_TRGINCFGR_TRG7POL     HSP_TRGINCFGR_TRG7POL_Msk            /*!< TRG7POL (Polarity selection for TRGIN7) */

#define HSP_TRGINCFGR_TRG8POL_Pos (8UL)
#define HSP_TRGINCFGR_TRG8POL_Msk (0x1UL << HSP_TRGINCFGR_TRG8POL_Pos) /*!< 0x00000100 */
#define HSP_TRGINCFGR_TRG8POL     HSP_TRGINCFGR_TRG8POL_Msk            /*!< TRG8POL (Polarity selection for TRGIN8) */

#define HSP_TRGINCFGR_TRG9POL_Pos (9UL)
#define HSP_TRGINCFGR_TRG9POL_Msk (0x1UL << HSP_TRGINCFGR_TRG9POL_Pos) /*!< 0x00000200 */
#define HSP_TRGINCFGR_TRG9POL     HSP_TRGINCFGR_TRG9POL_Msk            /*!< TRG9POL (Polarity selection for TRGIN9) */

/********************  Bit definition for HSP_TRGOCFGR register  ********************/
#define HSP_TRGOCFGR_TRGO0SRC_Pos (0UL)
#define HSP_TRGOCFGR_TRGO0SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO0SRC_Pos) /*!< 0x00000003 */
#define HSP_TRGOCFGR_TRGO0SRC     HSP_TRGOCFGR_TRGO0SRC_Msk            /*!< TRGO0SRC[1:0] bits (Trigger source selection for hsp_trg_out[0] <sup>(1)</sup>) */
#define HSP_TRGOCFGR_TRGO0SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO0SRC_Pos) /*!< 0x00000001 */
#define HSP_TRGOCFGR_TRGO0SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO0SRC_Pos) /*!< 0x00000002 */

#define HSP_TRGOCFGR_TRGO1SRC_Pos (2UL)
#define HSP_TRGOCFGR_TRGO1SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO1SRC_Pos) /*!< 0x0000000C */
#define HSP_TRGOCFGR_TRGO1SRC     HSP_TRGOCFGR_TRGO1SRC_Msk            /*!< TRGO1SRC[1:0] bits (Trigger source selection for hsp_trg_out[1] <sup>(1)</sup>) */
#define HSP_TRGOCFGR_TRGO1SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO1SRC_Pos) /*!< 0x00000004 */
#define HSP_TRGOCFGR_TRGO1SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO1SRC_Pos) /*!< 0x00000008 */

#define HSP_TRGOCFGR_TRGO2SRC_Pos (4UL)
#define HSP_TRGOCFGR_TRGO2SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO2SRC_Pos) /*!< 0x00000030 */
#define HSP_TRGOCFGR_TRGO2SRC     HSP_TRGOCFGR_TRGO2SRC_Msk            /*!< TRGO2SRC[1:0] bits (Trigger source selection for hsp_trg_out[2] <sup>(1)</sup>) */
#define HSP_TRGOCFGR_TRGO2SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO2SRC_Pos) /*!< 0x00000010 */
#define HSP_TRGOCFGR_TRGO2SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO2SRC_Pos) /*!< 0x00000020 */

#define HSP_TRGOCFGR_TRGO3SRC_Pos (6UL)
#define HSP_TRGOCFGR_TRGO3SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO3SRC_Pos) /*!< 0x000000C0 */
#define HSP_TRGOCFGR_TRGO3SRC     HSP_TRGOCFGR_TRGO3SRC_Msk            /*!< TRGO3SRC[1:0] bits (Trigger source selection for hsp_trg_out[3] ) */
#define HSP_TRGOCFGR_TRGO3SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO3SRC_Pos) /*!< 0x00000040 */
#define HSP_TRGOCFGR_TRGO3SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO3SRC_Pos) /*!< 0x00000080 */

/********************  Bit definition for HSP_CSEGR register  ********************/
#define HSP_CSEGR_CSEVT_Pos (1UL)
#define HSP_CSEGR_CSEVT_Msk (0x3FFFFFUL << HSP_CSEGR_CSEVT_Pos) /*!< 0x007FFFFE */
#define HSP_CSEGR_CSEVT     HSP_CSEGR_CSEVT_Msk                 /*!< CSEVT[21:0] bits (CPU Shared Software Event ) */
#define HSP_CSEGR_CSEVT_0   (0x0001UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000002 */
#define HSP_CSEGR_CSEVT_1   (0x0002UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000004 */
#define HSP_CSEGR_CSEVT_2   (0x0004UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000008 */
#define HSP_CSEGR_CSEVT_3   (0x0008UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000010 */
#define HSP_CSEGR_CSEVT_4   (0x0010UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000020 */
#define HSP_CSEGR_CSEVT_5   (0x0020UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000040 */
#define HSP_CSEGR_CSEVT_6   (0x0040UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000080 */
#define HSP_CSEGR_CSEVT_7   (0x0080UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000100 */
#define HSP_CSEGR_CSEVT_8   (0x0100UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000200 */
#define HSP_CSEGR_CSEVT_9   (0x0200UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000400 */
#define HSP_CSEGR_CSEVT_10  (0x0400UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000800 */
#define HSP_CSEGR_CSEVT_11  (0x0800UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00001000 */
#define HSP_CSEGR_CSEVT_12  (0x1000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00002000 */
#define HSP_CSEGR_CSEVT_13  (0x2000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00004000 */
#define HSP_CSEGR_CSEVT_14  (0x4000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00008000 */
#define HSP_CSEGR_CSEVT_15  (0x8000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00010000 */
#define HSP_CSEGR_CSEVT_16  (0x10000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00020000 */
#define HSP_CSEGR_CSEVT_17  (0x20000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00040000 */
#define HSP_CSEGR_CSEVT_18  (0x40000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00080000 */
#define HSP_CSEGR_CSEVT_19  (0x80000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00100000 */
#define HSP_CSEGR_CSEVT_20  (0x100000UL << HSP_CSEGR_CSEVT_Pos) /*!< 0x00200000 */
#define HSP_CSEGR_CSEVT_21  (0x200000UL << HSP_CSEGR_CSEVT_Pos) /*!< 0x00400000 */

/********************  Bit definition for HSP_CDEGR register  ********************/
#define HSP_CDEGR_CTSKN_Pos   (0UL)
#define HSP_CDEGR_CTSKN_Msk   (0x3FUL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x0000003F */
#define HSP_CDEGR_CTSKN       HSP_CDEGR_CTSKN_Msk              /*!< CTSKN[5:0] bits (CPU Task number) */

#define HSP_CDEGR_CDEGBSY_Pos (31UL)
#define HSP_CDEGR_CDEGBSY_Msk (0x1UL << HSP_CDEGR_CDEGBSY_Pos) /*!< 0x80000000 */
#define HSP_CDEGR_CDEGBSY     HSP_CDEGR_CDEGBSY_Msk            /*!< CDEGBSY (CPU dedicated event generator busy) */

/********************  Bit definition for HSP_TRGINSELR0 register  ********************/
#define HSP_TRGINSELR0_TRG0SEL_Pos (0UL)
#define HSP_TRGINSELR0_TRG0SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x0000003F */
#define HSP_TRGINSELR0_TRG0SEL     HSP_TRGINSELR0_TRG0SEL_Msk             /*!< TRG0SEL[5:0] bits (Input trigger selection for TRGIN0) */
#define HSP_TRGINSELR0_TRG0SEL_0   (0x01UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000001 */
#define HSP_TRGINSELR0_TRG0SEL_1   (0x02UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000002 */
#define HSP_TRGINSELR0_TRG0SEL_2   (0x04UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000004 */
#define HSP_TRGINSELR0_TRG0SEL_3   (0x08UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000008 */
#define HSP_TRGINSELR0_TRG0SEL_4   (0x10UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000010 */
#define HSP_TRGINSELR0_TRG0SEL_5   (0x20UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000020 */

#define HSP_TRGINSELR0_TRG1SEL_Pos (8UL)
#define HSP_TRGINSELR0_TRG1SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00003F00 */
#define HSP_TRGINSELR0_TRG1SEL     HSP_TRGINSELR0_TRG1SEL_Msk             /*!< TRG1SEL[5:0] bits (Input trigger selection for TRGIN1) */
#define HSP_TRGINSELR0_TRG1SEL_0   (0x01UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000100 */
#define HSP_TRGINSELR0_TRG1SEL_1   (0x02UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000200 */
#define HSP_TRGINSELR0_TRG1SEL_2   (0x04UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000400 */
#define HSP_TRGINSELR0_TRG1SEL_3   (0x08UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000800 */
#define HSP_TRGINSELR0_TRG1SEL_4   (0x10UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00001000 */
#define HSP_TRGINSELR0_TRG1SEL_5   (0x20UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00002000 */

#define HSP_TRGINSELR0_TRG2SEL_Pos (16UL)
#define HSP_TRGINSELR0_TRG2SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x003F0000 */
#define HSP_TRGINSELR0_TRG2SEL     HSP_TRGINSELR0_TRG2SEL_Msk             /*!< TRG2SEL[5:0] bits (Input trigger selection for TRGIN2) */
#define HSP_TRGINSELR0_TRG2SEL_0   (0x01UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00010000 */
#define HSP_TRGINSELR0_TRG2SEL_1   (0x02UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00020000 */
#define HSP_TRGINSELR0_TRG2SEL_2   (0x04UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00040000 */
#define HSP_TRGINSELR0_TRG2SEL_3   (0x08UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00080000 */
#define HSP_TRGINSELR0_TRG2SEL_4   (0x10UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00100000 */
#define HSP_TRGINSELR0_TRG2SEL_5   (0x20UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00200000 */

#define HSP_TRGINSELR0_TRG3SEL_Pos (24UL)
#define HSP_TRGINSELR0_TRG3SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x3F000000 */
#define HSP_TRGINSELR0_TRG3SEL     HSP_TRGINSELR0_TRG3SEL_Msk             /*!< TRG3SEL[5:0] bits (Input trigger selection for TRGIN3) */
#define HSP_TRGINSELR0_TRG3SEL_0   (0x01UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x01000000 */
#define HSP_TRGINSELR0_TRG3SEL_1   (0x02UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x02000000 */
#define HSP_TRGINSELR0_TRG3SEL_2   (0x04UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x04000000 */
#define HSP_TRGINSELR0_TRG3SEL_3   (0x08UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x08000000 */
#define HSP_TRGINSELR0_TRG3SEL_4   (0x10UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x10000000 */
#define HSP_TRGINSELR0_TRG3SEL_5   (0x20UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_TRGINSELR1 register  ********************/
#define HSP_TRGINSELR1_TRG4SEL_Pos (0UL)
#define HSP_TRGINSELR1_TRG4SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x0000003F */
#define HSP_TRGINSELR1_TRG4SEL     HSP_TRGINSELR1_TRG4SEL_Msk             /*!< TRG4SEL[5:0] bits (Input trigger selection for TRGIN4) */
#define HSP_TRGINSELR1_TRG4SEL_0   (0x01UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000001 */
#define HSP_TRGINSELR1_TRG4SEL_1   (0x02UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000002 */
#define HSP_TRGINSELR1_TRG4SEL_2   (0x04UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000004 */
#define HSP_TRGINSELR1_TRG4SEL_3   (0x08UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000008 */
#define HSP_TRGINSELR1_TRG4SEL_4   (0x10UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000010 */
#define HSP_TRGINSELR1_TRG4SEL_5   (0x20UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000020 */

#define HSP_TRGINSELR1_TRG5SEL_Pos (8UL)
#define HSP_TRGINSELR1_TRG5SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00003F00 */
#define HSP_TRGINSELR1_TRG5SEL     HSP_TRGINSELR1_TRG5SEL_Msk             /*!< TRG5SEL[5:0] bits (Input trigger selection for TRGIN5) */
#define HSP_TRGINSELR1_TRG5SEL_0   (0x01UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000100 */
#define HSP_TRGINSELR1_TRG5SEL_1   (0x02UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000200 */
#define HSP_TRGINSELR1_TRG5SEL_2   (0x04UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000400 */
#define HSP_TRGINSELR1_TRG5SEL_3   (0x08UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000800 */
#define HSP_TRGINSELR1_TRG5SEL_4   (0x10UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00001000 */
#define HSP_TRGINSELR1_TRG5SEL_5   (0x20UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00002000 */

