zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u396xx.h
/********************  Bit definition for HSP_PARAMR9 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR9_PARAM_Pos (0UL)
#define HSP_PARAMR9_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR9_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR9_PARAM     HSP_PARAMR9_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR10 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR10_PARAM_Pos (0UL)
#define HSP_PARAMR10_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR10_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR10_PARAM     HSP_PARAMR10_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR11 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR11_PARAM_Pos (0UL)
#define HSP_PARAMR11_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR11_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR11_PARAM     HSP_PARAMR11_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR12 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR12_PARAM_Pos (0UL)
#define HSP_PARAMR12_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR12_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR12_PARAM     HSP_PARAMR12_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR13 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR13_PARAM_Pos (0UL)
#define HSP_PARAMR13_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR13_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR13_PARAM     HSP_PARAMR13_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR14 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR14_PARAM_Pos (0UL)
#define HSP_PARAMR14_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR14_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR14_PARAM     HSP_PARAMR14_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR15 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR15_PARAM_Pos (0UL)
#define HSP_PARAMR15_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR15_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR15_PARAM     HSP_PARAMR15_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_SPE_IER register  ********************/
#define HSP_SPE_IER_C2HMRDYIE_Pos  (0UL)
#define HSP_SPE_IER_C2HMRDYIE_Msk  (0x1UL << HSP_SPE_IER_C2HMRDYIE_Pos)  /*!< 0x00000001 */
#define HSP_SPE_IER_C2HMRDYIE      HSP_SPE_IER_C2HMRDYIE_Msk             /*!< C2HMRDYIE (CPU to SPE message ready interrupt enable) */

#define HSP_SPE_IER_H2CMFREEIE_Pos (1UL)
#define HSP_SPE_IER_H2CMFREEIE_Msk (0x1UL << HSP_SPE_IER_H2CMFREEIE_Pos) /*!< 0x00000002 */
#define HSP_SPE_IER_H2CMFREEIE     HSP_SPE_IER_H2CMFREEIE_Msk            /*!< H2CMFREEIE (SPE to CPU message free interrupt enable) */

/********************  Bit definition for HSP_SPE_ISR register  ********************/
#define HSP_SPE_ISR_C2HMRDYF_Pos  (0UL)
#define HSP_SPE_ISR_C2HMRDYF_Msk  (0x1UL << HSP_SPE_ISR_C2HMRDYF_Pos)  /*!< 0x00000001 */
#define HSP_SPE_ISR_C2HMRDYF      HSP_SPE_ISR_C2HMRDYF_Msk             /*!< C2HMRDYF (CPU to SPE message box status) */

#define HSP_SPE_ISR_H2CMFREEF_Pos (1UL)
#define HSP_SPE_ISR_H2CMFREEF_Msk (0x1UL << HSP_SPE_ISR_H2CMFREEF_Pos) /*!< 0x00000002 */
#define HSP_SPE_ISR_H2CMFREEF     HSP_SPE_ISR_H2CMFREEF_Msk            /*!< H2CMFREEF (SPE to CPU message box status) */

#define HSP_SPE_ISR_RSTREQF_Pos   (4UL)
#define HSP_SPE_ISR_RSTREQF_Msk   (0x1UL << HSP_SPE_ISR_RSTREQF_Pos)   /*!< 0x00000010 */
#define HSP_SPE_ISR_RSTREQF       HSP_SPE_ISR_RSTREQF_Msk              /*!< RSTREQF (HSP reset request) */

#define HSP_SPE_ISR_BUF0EVTF_Pos  (12UL)
#define HSP_SPE_ISR_BUF0EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF0EVTF_Pos)  /*!< 0x00001000 */
#define HSP_SPE_ISR_BUF0EVTF      HSP_SPE_ISR_BUF0EVTF_Msk             /*!< BUF0EVTF (BUF0 status) */

#define HSP_SPE_ISR_BUF1EVTF_Pos  (13UL)
#define HSP_SPE_ISR_BUF1EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF1EVTF_Pos)  /*!< 0x00002000 */
#define HSP_SPE_ISR_BUF1EVTF      HSP_SPE_ISR_BUF1EVTF_Msk             /*!< BUF1EVTF (BUF1 status) */

#define HSP_SPE_ISR_BUF2EVTF_Pos  (14UL)
#define HSP_SPE_ISR_BUF2EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF2EVTF_Pos)  /*!< 0x00004000 */
#define HSP_SPE_ISR_BUF2EVTF      HSP_SPE_ISR_BUF2EVTF_Msk             /*!< BUF2EVTF (BUF2 status) */

#define HSP_SPE_ISR_BUF3EVTF_Pos  (15UL)
#define HSP_SPE_ISR_BUF3EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF3EVTF_Pos)  /*!< 0x00008000 */
#define HSP_SPE_ISR_BUF3EVTF      HSP_SPE_ISR_BUF3EVTF_Msk             /*!< BUF3EVTF (BUF3 status) */

/********************  Bit definition for HSP_TCUCFGR register  ********************/
#define HSP_TCUCFGR_TSKCMP0_Pos (0UL)
#define HSP_TCUCFGR_TSKCMP0_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x0000003F */
#define HSP_TCUCFGR_TSKCMP0     HSP_TCUCFGR_TSKCMP0_Msk             /*!< TSKCMP0[5:0] bits (Task compare 0 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP0_0   (0x01UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000001 */
#define HSP_TCUCFGR_TSKCMP0_1   (0x02UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000002 */
#define HSP_TCUCFGR_TSKCMP0_2   (0x04UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000004 */
#define HSP_TCUCFGR_TSKCMP0_3   (0x08UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000008 */
#define HSP_TCUCFGR_TSKCMP0_4   (0x10UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000010 */
#define HSP_TCUCFGR_TSKCMP0_5   (0x20UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000020 */

#define HSP_TCUCFGR_TC0EN_Pos   (7UL)
#define HSP_TCUCFGR_TC0EN_Msk   (0x1UL << HSP_TCUCFGR_TC0EN_Pos)    /*!< 0x00000080 */
#define HSP_TCUCFGR_TC0EN       HSP_TCUCFGR_TC0EN_Msk               /*!< TC0EN (Task comparator 0 enable <sup>(1)</sup>) */

#define HSP_TCUCFGR_TSKCMP1_Pos (8UL)
#define HSP_TCUCFGR_TSKCMP1_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00003F00 */
#define HSP_TCUCFGR_TSKCMP1     HSP_TCUCFGR_TSKCMP1_Msk             /*!< TSKCMP1[5:0] bits (Task compare 1 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP1_0   (0x01UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000100 */
#define HSP_TCUCFGR_TSKCMP1_1   (0x02UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000200 */
#define HSP_TCUCFGR_TSKCMP1_2   (0x04UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000400 */
#define HSP_TCUCFGR_TSKCMP1_3   (0x08UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000800 */
#define HSP_TCUCFGR_TSKCMP1_4   (0x10UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00001000 */
#define HSP_TCUCFGR_TSKCMP1_5   (0x20UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00002000 */

#define HSP_TCUCFGR_TC1EN_Pos   (15UL)
#define HSP_TCUCFGR_TC1EN_Msk   (0x1UL << HSP_TCUCFGR_TC1EN_Pos)    /*!< 0x00008000 */
#define HSP_TCUCFGR_TC1EN       HSP_TCUCFGR_TC1EN_Msk               /*!< TC1EN (Task comparator 1 enable <sup>(1)</sup>) */

#define HSP_TCUCFGR_TSKCMP2_Pos (16UL)
#define HSP_TCUCFGR_TSKCMP2_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x003F0000 */
#define HSP_TCUCFGR_TSKCMP2     HSP_TCUCFGR_TSKCMP2_Msk             /*!< TSKCMP2[5:0] bits (Task compare 2 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP2_0   (0x01UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00010000 */
#define HSP_TCUCFGR_TSKCMP2_1   (0x02UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00020000 */
#define HSP_TCUCFGR_TSKCMP2_2   (0x04UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00040000 */
#define HSP_TCUCFGR_TSKCMP2_3   (0x08UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00080000 */
#define HSP_TCUCFGR_TSKCMP2_4   (0x10UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00100000 */
#define HSP_TCUCFGR_TSKCMP2_5   (0x20UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00200000 */

